# 3. Напишите программу, в которой пользователь будет задавать две строки,
# программа - определять количество вхождений одной строки в другой.

a = input("Введите первое слово: ")
b = input("Введите второе слово: ")

print(a.count(b))